stressTest.yml
config:
  target: 'http://localhost:3002'
  processor: "./stressTest.js"
  phases:
    - duration: 30
      arrivalRate: 500
scenarios:
  - name: "Request a course reviews"
    flow:
      - function: "generateRandomId"
      - get:
          url: "/courses/{{ courseId }}/"
          json: 
            courseId: "{{ courseId }}"